data/script_request_body.xml

`<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:CampaignService="http://www.healthenterprises.com.au/rescripts/Campaign/" xmlns:Campaign="http://www.healthenterprises.com.au/rescripts/Campaign/wsdl/" xmlns:Compliance="http://www.healthenterprises.com.au/rescripts/Compliance/wsdl/" xmlns:ProviderService="http://www.healthenterprises.com.au/rescripts/Provider/" xmlns:Provider="http://www.healthenterprises.com.au/rescripts/Provider/wsdl/" xmlns:Report="http://www.healthenterprises.com.au/rescripts/Report/wsdl/" xmlns:SMSService="http://www.healthenterprises.com.au/rescripts/SMS/" xmlns:SMS="http://www.healthenterprises.com.au/rescripts/SMS/wsdl/" xmlns:ScriptService="http://www.healthenterprises.com.au/rescripts/Script/" xmlns:Script="http://www.healthenterprises.com.au/rescripts/Script/wsdl/" xmlns:UserSessionService="http://www.healthenterprises.com.au/rescripts/UserSession/" xmlns:UserSession="http://www.healthenterprises.com.au/rescripts/UserSession/wsdl/">
    <SOAP-ENV:Body>
        <Script:sendRequest>
            <Script:sessionId>${sessionId}</Script:sessionId>
            <Script:reference>MA34400004421188${helpers.randomNumber(12)}</Script:reference>
            <Script:faxNo>${dataRow.doctor_email}</Script:faxNo>
            <Script:phoneNo>98${helpers.randomNumber(6)}</Script:phoneNo>
            <Script:prescriberNo>email</Script:prescriberNo>
            <Script:requiredBy>2020-06-28T14:00:00Z</Script:requiredBy>
            <Script:urgent>true</Script:urgent>
            <Script:resent>false</Script:resent>
            <Script:hl7Message>MSH|^~\&amp;|PlusOne 3.3.24.1|${dataRow.pharmacy_id}|Priscilla||${helpers.currTime()}||ORM^O01|MA34400004420|P|2.4^AUS||||NE|AUS||en&#xD;PID|||33^^^PlusOne^PI^^^~485^^^WiniFred^PI^^^~4283734251/1^^^AUSHIC^MC^^^||${dataRow.patient_last_name}^${dataRow.patient_first_name}^^^MR^^D^^||19880302|M|||HAROLD STREET^^CAMBERWELL^^2330^AU^C|||||||2||||||||||||||||||N|&#xD;PV1|||^^^^^^^^NO FACILITY||||||||||||||||||&#xD;ORC|RF|MA34400004420-0||MA34400004420|||||${helpers.currTime()}|||1234567^${dataRow.doctor_lastname}^${dataRow.doctor_firstname}^^^Dr^^^AUSHIC||^WPN^PH^^^^98671400~^WPN^FX^^^^98214622~^NET^Internet^${dataRow.doctor_email}^^^|${helpers.currTime()}|^O-Owing|MA344|||||||3/499 ST VINCENT'S HOSPI^^ MELBOURNE ^^ 4350 ^ AUS ^ C |&#xD; RXO |^ ${ dataRow.drug_name } }|||| PTCH ^^ L |^ Apply | ${ dataRow.drug_type } || N |^ ${ dataRow.drug_name }| 2 || 0 ||||||^ 10mcg / hr ^ L ||&#xD; RXE |||||||||||||||||||${dataRow.dispense_date}||||||||||||||${dataRow.script_date}|&#xD; NTE | 1 | PH ||&#xD;</Script:hl7Message>
                <Script:pageBreak>false</Script:pageBreak>
                <Script:useScriptDate>false</Script:useScriptDate>
                </Script:sendRequest>
                </SOAP-ENV:Body>
                </SOAP-ENV:Envelope>`